ObjectStorage/Catalogs/S3_СервисныеАккаунтыОбъектныхХранилищ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>S3_СервисныеАккаунтыОбъектныхХранилищ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАутентификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ObjectStorage/Catalogs/S3_СервисныеАккаунтыОбъектныхХранилищ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СервисныйАккаунтПоУмолчанию() Экспорт
	Возврат Константы.S3_СервисныйАккаунтПоУмолчанию.Получить();
КонецФункции

Функция ПолучитьНастройкиСервисногоАккаунта(СервисныйАккаунт) Экспорт
	
	НастройкиСервисногоАккаунта = НовыйНастройкиСервисногоАккаунта();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	S3_СервисныеАккаунтыОбъектныхХранилищ.Ссылка КАК СервисныйАккаунт,
	|	S3_СервисныеАккаунтыОбъектныхХранилищ.Сервер КАК Сервер,
	|	S3_СервисныеАккаунтыОбъектныхХранилищ.Регион КАК Регион,
	|	S3_СервисныеАккаунтыОбъектныхХранилищ.ЗащищенноеСоединение КАК ЗащищенноеСоединение,
	|	S3_СервисныеАккаунтыОбъектныхХранилищ.ТипАутентификации КАК ТипАутентификации,
	|	S3_СервисныеАккаунтыОбъектныхХранилищ.Сервис КАК Сервис,
	|	S3_СервисныеАккаунтыОбъектныхХранилищ.Использовать КАК Использовать
	|ИЗ
	|	Справочник.S3_СервисныеАккаунтыОбъектныхХранилищ КАК S3_СервисныеАккаунтыОбъектныхХранилищ
	|ГДЕ
	|	S3_СервисныеАккаунтыОбъектныхХранилищ.Ссылка = &Ссылка
	|	И НЕ S3_СервисныеАккаунтыОбъектныхХранилищ.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Ссылка", СервисныйАккаунт);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НастройкиСервисногоАккаунта, Выборка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НастройкиСервисногоАккаунта.СервисныйАккаунт) Тогда
		
		Ключи = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			НастройкиСервисногоАккаунта.СервисныйАккаунт,
			"ИдентификаторКлюча, СекретныйКлюч");
		
		Если Ключи <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НастройкиСервисногоАккаунта, Ключи);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НастройкиСервисногоАккаунта;
	
КонецФункции

Функция НовыйНастройкиСервисногоАккаунта()
	
	НастройкиСервисногоАккаунта = Новый Структура;
	НастройкиСервисногоАккаунта.Вставить("СервисныйАккаунт");
	НастройкиСервисногоАккаунта.Вставить("Сервер");
	НастройкиСервисногоАккаунта.Вставить("Регион");
	НастройкиСервисногоАккаунта.Вставить("ЗащищенноеСоединение");
	НастройкиСервисногоАккаунта.Вставить("ТипАутентификации");
	НастройкиСервисногоАккаунта.Вставить("Сервис");
	НастройкиСервисногоАккаунта.Вставить("Использовать");
	НастройкиСервисногоАккаунта.Вставить("ИдентификаторКлюча");
	НастройкиСервисногоАккаунта.Вставить("СекретныйКлюч");
	
	Возврат НастройкиСервисногоАккаунта;
	
КонецФункции

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
